# Koşullu Eleman İşlemleri

In [2]:
import numpy as np
import pandas as pd

In [3]:
m=np.random.randint(1,30, size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    14    25     5
1    19    14    21
2     9    12    17
3     1    22    25
4     6    20    16
5    19    28    19
6    13    20    29
7    28     5    13
8    22    27     1
9    24     4     9

In [4]:
df["var3"]

0     5
1    21
2    17
3    25
4    16
5    19
6    29
7    13
8     1
9     9
Name: var3, dtype: int64

In [5]:
df["var1"][0:2] # satır: 2 dahil değil, sütun: var1

0    14
1    19
Name: var1, dtype: int64

In [6]:
df[0:2] # satır: 2 dahil değil

   var1  var2  var3
0    14    25     5
1    19    14    21

# df[0:2]["var1","var2"] -->> HATA!! Fancy ile yapılabilir

In [7]:
df[0:2][["var1","var2"]]

   var1  var2
0    14    25
1    19    14

In [8]:
df.var1

0    14
1    19
2     9
3     1
4     6
5    19
6    13
7    28
8    22
9    24
Name: var1, dtype: int64

In [9]:
# var1'deki değerlerin 15den büyük olmasını değerlendirelim
df[df.var1>15]

   var1  var2  var3
1    19    14    21
5    19    28    19
7    28     5    13
8    22    27     1
9    24     4     9

In [10]:
# var1'deki değerlerin 15den büyük olmasını değerlendirelim
df[df.var1>15]["var1"] # sadece var1'i göstersin

1    19
5    19
7    28
8    22
9    24
Name: var1, dtype: int64

In [12]:
df[(df.var1>15)&(df.var3<17)]

   var1  var2  var3
7    28     5    13
8    22    27     1
9    24     4     9

In [11]:
# var1'deki değerlerin 15den büyük olmasını değerlendirelim
df[df.var1>15]["var3"] # sadece var3'ü göstersin

1    21
5    19
7    13
8     1
9     9
Name: var3, dtype: int64

In [14]:
df[df.var1>15][["var1","var2"]]

   var1  var2
1    19    14
5    19    28
7    28     5
8    22    27
9    24     4

df[(df.var1>15),["var1","var2"]] -->> HATA!!

In [ ]:
df.loc[(df.var1>15),["var1","var2"]]